pyrho/stm32f4_wm8960/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "lcd.h"
#include "stm32f4xx_hal_i2s.h"
#include "wm8960.h"
#include <stdio.h>
#include <string.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define INT16_TO_FLOAT 1.0f / 32768.0f
#define FLOAT_TO_INT16 32768.0f

const uint16_t triangle_wave[] = {
    0x400,  0x800,  0xc00,  0x1000, 0x1400, 0x1800, 0x1c00, 0x2000, 0x2400,
    0x2800, 0x2c00, 0x3000, 0x3400, 0x3800, 0x3c00, 0x4000, 0x4400, 0x4800,
    0x4c00, 0x5000, 0x5400, 0x5800, 0x5c00, 0x6000, 0x6400, 0x6800, 0x6c00,
    0x7000, 0x7400, 0x7800, 0x7c00, 0x8000, 0x83ff, 0x87ff, 0x8bff, 0x8fff,
    0x93ff, 0x97ff, 0x9bff, 0x9fff, 0xa3ff, 0xa7ff, 0xabff, 0xafff, 0xb3ff,
    0xb7ff, 0xbbff, 0xbfff, 0xc3ff, 0xc7ff, 0xcbff, 0xcfff, 0xd3ff, 0xd7ff,
    0xdbff, 0xdfff, 0xe3ff, 0xe7ff, 0xebff, 0xefff, 0xf3ff, 0xf7ff, 0xfbff,
    0xffff, 0xfbff, 0xf7ff, 0xf3ff, 0xefff, 0xebff, 0xe7ff, 0xe3ff, 0xdfff,
    0xdbff, 0xd7ff, 0xd3ff, 0xcfff, 0xcbff, 0xc7ff, 0xc3ff, 0xbfff, 0xbbff,
    0xb7ff, 0xb3ff, 0xafff, 0xabff, 0xa7ff, 0xa3ff, 0x9fff, 0x9bff, 0x97ff,
    0x93ff, 0x8fff, 0x8bff, 0x87ff, 0x83ff, 0x8000, 0x7c00, 0x7800, 0x7400,
    0x7000, 0x6c00, 0x6800, 0x6400, 0x6000, 0x5c00, 0x5800, 0x5400, 0x5000,
    0x4c00, 0x4800, 0x4400, 0x4000, 0x3c00, 0x3800, 0x3400, 0x3000, 0x2c00,
    0x2800, 0x2400, 0x2000, 0x1c00, 0x1800, 0x1400, 0x1000, 0xc00,  0x800,
    0x400,  0x0,
};
const uint8_t tri_cnt = 0;

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

I2S_HandleTypeDef hi2s2;
DMA_HandleTypeDef hdma_spi2_rx;
DMA_HandleTypeDef hdma_i2s2_ext_tx;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim6;

UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
WM8960_t *codecInstance = NULL;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM6_Init(void);
static void MX_I2S2_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#define BUFFER_SIZE 128
int16_t adcData[BUFFER_SIZE];
int16_t dacData[BUFFER_SIZE];

bool dataReadyFlag = false;

char g_messageBuf[60];

uint16_t rxBuf[BUFFER_SIZE];
uint16_t txBuf[BUFFER_SIZE];
float lin_z1, lin_z2, lout_z1, lout_z2;
float rin_z1, rin_z2, rout_z1, rout_z2;
// left-channel, High-Pass, 1kHz, fs=96kHz, q=0.7
float l_a0 = 0.9543457485325094f;
float l_a1 = -1.9086914970650188f;
float l_a2 = 0.9543457485325094f;
float l_b1 = -1.9066459797557103f;
float l_b2 = 0.9107370143743273f;

// right-channel, Low-Pass, 1kHz, fs)96 kHz, q=0.7
float r_a0 = 0.0010227586546542474f;
float r_a1 = 0.002045517309308495f;
float r_a2 = 0.0010227586546542474f;
float r_b1 = -1.9066459797557103f;
float r_b2 = 0.9107370143743273f;

// void HAL_I2SEx_TxRxHalfCpltCallback(I2S_HandleTypeDef *hi2s);
// void HAL_I2SEx_TxRxCpltCallback(I2S_HandleTypeDef *hi2s) {
//
//  strcpy((char *)g_messageBuf, "[WOW] Fuck yea\r\n");
//  HAL_UART_Transmit(&huart3, (uint8_t *)&g_messageBuf, strlen(g_messageBuf),
//                    HAL_MAX_DELAY);
//}
int Calc_IIR_Left(int inSample) {
  float inSampleF = (float)inSample;
  float outSampleF = l_a0 * inSampleF + l_a1 * lin_z1 + l_a2 * lin_z2 -
                     l_b1 * lout_z1 - l_b2 * lout_z2;
  lin_z2 = lin_z1;
  lin_z1 = inSampleF;
  lout_z2 = lout_z1;
  lout_z1 = outSampleF;

  return (int)outSampleF;
}

int Calc_IIR_Right(int inSample) {
  float inSampleF = (float)inSample;
  float outSampleF = r_a0 * inSampleF + r_a1 * rin_z1 + r_a2 * rin_z2 -
                     r_b1 * rout_z1 - r_b2 * rout_z2;
  rin_z2 = rin_z1;
  rin_z1 = inSampleF;
  rout_z2 = rout_z1;
  rout_z1 = outSampleF;

  return (int)outSampleF;
}

void HAL_I2SEx_TxRxHalfCpltCallback(I2S_HandleTypeDef *hi2s) {
	memcpy(dacData, adcData, (BUFFER_SIZE/2) * sizeof(adcData[0]));
  //    inBufPtr = adcData;
  //    for(uint8_t i = 0; i < BUFFER_SIZE - 1; ++i) {
  //    	outBufPtr[i] = inBufPtr[i];
  //    	outBufPtr[i+1] = inBufPtr[i];
  //    }

  //    outBufPtr = dacData;
//  dataReadyFlag = true;
  //
  //  // restore signed 24 bit sample from 16-bit buffers
  //  int lSample = (int)(rxBuf[0] << 16) | rxBuf[1];
  //  int rSample = (int)(rxBuf[2] << 16) | rxBuf[3];
  //
  //
  //  // divide by 2 (rightshift) -> -3dB per sample
  //  lSample = lSample >> 1;
  //  rSample = rSample >> 1;
  //
  //  // sum to mono
  //  lSample = rSample + lSample;
  //  rSample = lSample;
  //
  //  // run HP on left channel and LP on right channel
  //  lSample = Calc_IIR_Left(lSample);
  //  rSample = Calc_IIR_Right(rSample);
  //
  //  // restore to buffer
  //  txBuf[0] = (lSample >> 16) & 0xFFFF;
  //  txBuf[1] = lSample & 0xFFFF;
  //  txBuf[2] = (rSample >> 16) & 0xFFFF;
  //  txBuf[3] = rSample & 0xFFFF;
  // txBuf[0] = rxBuf[0];
  // txBuf[1] = rxBuf[1];
  // txBuf[2] = rxBuf[2];
  // txBuf[3] = rxBuf[3];
}

void HAL_I2SEx_TxRxCpltCallback(I2S_HandleTypeDef *hi2s) {
  //    inBufPtr = adcData + (BUFFER_SIZE/2);
  //    outBufPtr = dacData + (BUFFER_SIZE/2);
  //    dataReadyFlag = true;

	memcpy(dacData + (BUFFER_SIZE/2), adcData+ (BUFFER_SIZE/2), (BUFFER_SIZE/2) * sizeof(adcData[0]));
  //     for(uint8_t i = 0; i < BUFFER_SIZE - 1; ++i) {
  //     	outBufPtr[i] = inBufPtr[i];
  //     	outBufPtr[i+1] = inBufPtr[i];
  //     }

  // txBuf[4] = rxBuf[4];
  // txBuf[5] = rxBuf[5];
  // txBuf[6] = rxBuf[6];
  // txBuf[7] = rxBuf[7];

  //
  //  // restore signed 24 bit sample from 16-bit buffers
  //  int lSample = (int)(rxBuf[4] << 16) | rxBuf[5];
  //  int rSample = (int)(rxBuf[6] << 16) | rxBuf[7];
  //
  //  // divide by 2 (rightshift) -> -3dB per sample
  //  lSample = lSample >> 1;
  //  rSample = rSample >> 1;
  //
  //  // sum to mono
  //  lSample = rSample + lSample;
  //  rSample = lSample;
  //
  //  // run HP on left channel and LP on right channel
  //  lSample = Calc_IIR_Left(lSample);
  //  rSample = Calc_IIR_Right(rSample);
  //
  //  // restore to buffer
  //  txBuf[4] = (lSample >> 16) & 0xFFFF;
  //  txBuf[5] = lSample & 0xFFFF;
  //  txBuf[6] = (rSample >> 16) & 0xFFFF;
  //  txBuf[7] = rSample & 0xFFFF;
}

void initLcd() {
  HD44780_Init(2);
  HD44780_Clear();
  HD44780_SetBacklight(1);
  HD44780_SetCursor(0, 0);
  HD44780_PrintStr("FXBOI:RDY");
}

void displayToLcd(char *message) {
  HD44780_Clear();
  HD44780_PrintStr(message);
}

void testLcd() {
  HD44780_Init(2);
  HD44780_Clear();
  HD44780_SetBacklight(1);
  HD44780_SetCursor(0, 0);
  HD44780_PrintStr("STM32 NUCLEO");
  HD44780_SetCursor(0, 1);
  HD44780_PrintStr("I2C LCD DEMO");
  HAL_Delay(2000);

  HD44780_Clear();
  HD44780_SetCursor(16, 0);
  HD44780_PrintStr("SCROLL LEFT");

  for (int i = 0; i < 20; i++) {
    HD44780_ScrollDisplayLeft();
    HAL_Delay(500);
  }

  HD44780_Clear();
  HD44780_SetCursor(0, 0);
  HD44780_PrintStr("SCROLL RIGHT");

  for (int i = 0; i < 20; i++) {
    HD44780_ScrollDisplayRight();
    HAL_Delay(500);
  }

  HD44780_Clear();
  HD44780_SetCursor(0, 0);
  HD44780_PrintStr("Lets Count 0-10!");
  HAL_Delay(2000);

  char string[5];
  for (int counter = 0; counter <= 10; counter++) {
    itoa(counter, string, 10);
    HD44780_Clear();
    HD44780_SetCursor(0, 0);
    HD44780_PrintStr(string);
    HAL_Delay(1000);
  }
  HD44780_Clear();
  HD44780_SetCursor(0, 0);
  HD44780_PrintStr("STM32 NUCLEO");
  HD44780_SetCursor(0, 1);
  HD44780_PrintStr("I2C LCD DEMO END");
}

uint32_t cnt = 0;
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
  cnt = __HAL_TIM_GET_COUNTER(htim);
  char str[10];

  sprintf(&str, "%lu", cnt);
  //  displayToLcd(&str);
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
  if (GPIO_Pin == rotarybtn_Pin) {
    HAL_TIM_Base_Start_IT(&htim6);
  }
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM6) {
    // Debounce timer elapsed, check button state
    if (HAL_GPIO_ReadPin(rotarybtn_GPIO_Port, rotarybtn_Pin) == GPIO_PIN_SET) {
      // Button is still pressed after debounce period
      HAL_GPIO_TogglePin(LD1_GPIO_Port, LD1_Pin);
    }
    // Stop the timer until the next press
    HAL_TIM_Base_Stop_IT(htim);
  }
}

bool state = true;

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  char messageBuf[128];
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART3_UART_Init();
  MX_I2C1_Init();
  MX_TIM3_Init();
  MX_TIM6_Init();
  MX_I2S2_Init();
  /* USER CODE BEGIN 2 */

  // This timer is used for the incremental encoder
  HAL_TIM_Encoder_Start_IT(&htim3, TIM_CHANNEL_ALL);
  HAL_I2SEx_TransmitReceive_DMA(&hi2s2, dacData, adcData, BUFFER_SIZE);
  // testLcd();
  //  initLcd();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  while (1) {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

    // memcpy(outBufPtr, inBufPtr, BUFFER_SIZE * sizeof(outBufPtr[0]));
    //
    // HAL_StatusTypeDef halReturnStatus =
    //     HAL_I2SEx_TransmitReceive(&hi2s2, inBufPtr, inBufPtr, BUFFER_SIZE,
    //     8);
    //
    // if (halReturnStatus != HAL_OK) {
    //   strcpy((char *)messageBuf, "[ERROR] Failed to start I2S TX/RX.\r\n");
    //   HAL_UART_Transmit(&huart3, (uint8_t *)&messageBuf, strlen(messageBuf),
    //                     HAL_MAX_DELAY);
    // }
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 100;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 8;
  RCC_OscInitStruct.PLL.PLLR = 3;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  /* USER CODE BEGIN I2C1_Init 1 */

  /* USER CODE END I2C1_Init 1 */
  hi2c1.Instance = I2C1;
  hi2c1.Init.ClockSpeed = 100000;
  hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */
  //  Codec I2C setup {{{
  char messageBuf[100];
  if (!WM8960_isReady(&hi2c1)) {
    strcpy((char *)messageBuf,
           "[ERROR] I2C Communication with codec failed, device not ready. "
           "Aborting, restart device.\r\n");
    HAL_UART_Transmit(&huart3, (uint8_t *)&messageBuf, strlen(messageBuf),
                      HAL_MAX_DELAY);
  }

  HAL_StatusTypeDef halReturnStatus = HAL_OK;
  halReturnStatus += WM8960_init(&hi2c1, &codecInstance);

  if (halReturnStatus != HAL_OK) {
    strcpy((char *)messageBuf,
           "[ERROR] I2C initialization failed. Aborting.\r\n");
    HAL_UART_Transmit(&huart3, (uint8_t *)&messageBuf, strlen(messageBuf),
                      HAL_MAX_DELAY);
  }

  strcpy((char *)messageBuf, "[DEBUG] Codec setup OK\r\n");
  HAL_UART_Transmit(&huart3, (uint8_t *)&messageBuf, strlen(messageBuf),
                    HAL_MAX_DELAY);
  // }}}

  /* USER CODE END I2C1_Init 2 */

}

/**
  * @brief I2S2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2S2_Init(void)
{

  /* USER CODE BEGIN I2S2_Init 0 */

  /* USER CODE END I2S2_Init 0 */

  /* USER CODE BEGIN I2S2_Init 1 */

  /* USER CODE END I2S2_Init 1 */
  hi2s2.Instance = SPI2;
  hi2s2.Init.Mode = I2S_MODE_MASTER_RX;
  hi2s2.Init.Standard = I2S_STANDARD_PHILIPS;
  hi2s2.Init.DataFormat = I2S_DATAFORMAT_16B;
  hi2s2.Init.MCLKOutput = I2S_MCLKOUTPUT_DISABLE;
  hi2s2.Init.AudioFreq = I2S_AUDIOFREQ_48K;
  hi2s2.Init.CPOL = I2S_CPOL_LOW;
  hi2s2.Init.ClockSource = I2S_CLOCK_PLL;
  hi2s2.Init.FullDuplexMode = I2S_FULLDUPLEXMODE_ENABLE;
  if (HAL_I2S_Init(&hi2s2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2S2_Init 2 */

  /* USER CODE END I2S2_Init 2 */

}

/**
  * @brief TIM3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM3_Init(void)
{

  /* USER CODE BEGIN TIM3_Init 0 */

  /* USER CODE END TIM3_Init 0 */

  TIM_Encoder_InitTypeDef sConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM3_Init 1 */

  /* USER CODE END TIM3_Init 1 */
  htim3.Instance = TIM3;
  htim3.Init.Prescaler = 0;
  htim3.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim3.Init.Period = 65535;
  htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  sConfig.EncoderMode = TIM_ENCODERMODE_TI12;
  sConfig.IC1Polarity = TIM_ICPOLARITY_RISING;
  sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
  sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
  sConfig.IC1Filter = 0;
  sConfig.IC2Polarity = TIM_ICPOLARITY_RISING;
  sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
  sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
  sConfig.IC2Filter = 0;
  if (HAL_TIM_Encoder_Init(&htim3, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM3_Init 2 */

  /* USER CODE END TIM3_Init 2 */

}

/**
  * @brief TIM6 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM6_Init(void)
{

  /* USER CODE BEGIN TIM6_Init 0 */

  /* USER CODE END TIM6_Init 0 */

  TIM_MasterConfigTypeDef sMasterConfig = {0};

  /* USER CODE BEGIN TIM6_Init 1 */

  /* USER CODE END TIM6_Init 1 */
  htim6.Instance = TIM6;
  htim6.Init.Prescaler = 15;
  htim6.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim6.Init.Period = 59999;
  htim6.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim6) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim6, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM6_Init 2 */

  /* USER CODE END TIM6_Init 2 */

}

/**
  * @brief USART3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART3_UART_Init(void)
{

  /* USER CODE BEGIN USART3_Init 0 */

  /* USER CODE END USART3_Init 0 */

  /* USER CODE BEGIN USART3_Init 1 */

  /* USER CODE END USART3_Init 1 */
  huart3.Instance = USART3;
  huart3.Init.BaudRate = 115200;
  huart3.Init.WordLength = UART_WORDLENGTH_8B;
  huart3.Init.StopBits = UART_STOPBITS_1;
  huart3.Init.Parity = UART_PARITY_NONE;
  huart3.Init.Mode = UART_MODE_TX_RX;
  huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart3.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart3) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART3_Init 2 */

  /* USER CODE END USART3_Init 2 */

}

/**
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void)
{

  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Stream3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
  /* DMA1_Stream4_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, LD1_Pin|LD3_Pin|LD2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(USB_PowerSwitchOn_GPIO_Port, USB_PowerSwitchOn_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : USER_Btn_Pin */
  GPIO_InitStruct.Pin = USER_Btn_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(USER_Btn_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : PA0 PA1 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : LD1_Pin LD3_Pin LD2_Pin */
  GPIO_InitStruct.Pin = LD1_Pin|LD3_Pin|LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : rotarybtn_Pin */
  GPIO_InitStruct.Pin = rotarybtn_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(rotarybtn_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : USB_PowerSwitchOn_Pin */
  GPIO_InitStruct.Pin = USB_PowerSwitchOn_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(USB_PowerSwitchOn_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : USB_OverCurrent_Pin */
  GPIO_InitStruct.Pin = USB_OverCurrent_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(USB_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : USB_SOF_Pin USB_ID_Pin USB_DM_Pin USB_DP_Pin */
  GPIO_InitStruct.Pin = USB_SOF_Pin|USB_ID_Pin|USB_DM_Pin|USB_DP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
